/* eslint max-len: ["error", { "ignoreStrings": true }] */

const ru = {
  translation: {
    mainTitle: 'Входное задание в интернатуру',
    navigations: {
      theme: 'Тема',
      goal: 'Цель',
      discuss: 'Обсуждаемый материал',
      task: 'Задание'
    },
    entryAssignment: {
      theme: 'Git, node, npm, основы html css',
      goal: 'Изучить базовые функции git, node, npm. Подготовить к дальнейшей работе систему. Определить уровень умения верстки.',
      discussLi1: 'Что такое система контроля версий и зачем она нужна',
      discussLi2Text: 'Git',
      discussLi2A: 'Checkout, add, commit, pull, push',
      discussLi2B: 'Основы ветвления и слияния ',
      discussLi3: 'Что такое nodejs, зачем он нужен и как устанавливать',
      discussLi4: 'Что такое менеджер пакетов, установка npm',
      discussLi5: 'Html: теги, структура html страницы, блочные и строчные элементы, списки, таблицы, атрибуты, текст, якоря, ссылки, w3c валидация',
      discussLi6: 'Css: стили, классы, идентификаторы, селекторы, псевдоклассы, псевдоэлементы',
      task1Part1: 'Установить git, node, npm. Создать аккаунт на ',
      task1Part2: ' и публичный репозиторий для проекта. Клонировать из репозитория проект, сделать любые изменения в нем сделать коммит и запушить изменения.',
      task2: 'Создать простой шаблон страницы для дальнейшей работы. Страница должна содержать хедер, футер, блок с коротким описанием проекта и элементы из раздела “Обсуждаемый материал этого урока”(хотя бы по одному примеру). На странице должны быть: имя и фамилия автора, ссылка на github аккаунт, ссылка на оригинал дизайна. Страница должна проходить валидацию на w3c.',
    },
    author: 'Никита Ламекин'
  }
};

export default ru;
